ERP.belugaerp/src/Catalogs/бг_НастройкиФиксацииПечатныхФорм/бг_НастройкиФиксацииПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_НастройкиФиксацииПечатныхФорм</name>
  <attributes>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.бг_ФиксируемыеПечатныеФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичноеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторноеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиСканирования</name>
    <attributes>
      <name>ТегОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>EnumRef.бг_ОшибкиСканированияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаОшибки</name>
      <type>
        <types>CatalogRef.бг_РасшифровкиОшибокСканирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_ФиксацияПечатиДокументов/бг_ФиксацияПечатиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ФиксацияПечатиДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКорректировки</name>
    <type>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспечатанныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактураВыданный</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.бг_ФиксируемыеПечатныеФормы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_РасчетыСРозничнымиКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.бг_СуммовыеСкидкиЛокальные</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АдресГрузоотправитля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_АдресГрузополучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДанныеТранспортнаяНакладная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДоверенностьДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДокументОснованиеПоступлениеНаСклад</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗагруженБезДвижений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗагруженИзУПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗаказРозничногоПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоДнейОтсрочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КорректировкаОтсрочкиПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Лицензия</name>
    <type>
      <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерДокументаУПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СозданНаОснованииПоступленияОтПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УведомлениеОбОтгрузкеEDIОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УдалитьДокументОснованиеПоступлениеОтПоставщика</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОтпустилДолжность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ЕстьАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_ДокументОснованиеПоступлениеОтПоставщика</name>
      <type>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_СуммаНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/бг_НастройкиФиксацииПечатныхФорм/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Функция - Отбирает документы по настройкам фиксации
//
// Параметры:
//  РаспечатанныеДокументы	- ТаблицаЗначений - Список всех распечатанных объектов
//	АдресПовторноФиксируемыхДокументов - Неопределено - Адрес, по которому поместятся 
//		вторично фиксируемые документы
// 
// Возвращаемое значение:
// ТаблицаЗначений 
//
Функция ДокументыПоНастройкамФиксации(РаспечатанныеДокументы, АдресПовторноФиксируемыхДокументов) Экспорт
	
	ФиксироватьПовторнуюПечать = Пользователи.РолиДоступны("бг_ФиксироватьПечатьДокументовБезКонтроля");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтобранныеДокументы = ИнициализироватьТаблицуОтобранныхПоНастройкамДокументов(РаспечатанныеДокументы);	
		
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СформироватьВременнуюТаблицуСвязанныхДокументов(МенеджерВременныхТаблиц, РаспечатанныеДокументы);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеДокументы.Документ КАК Документ,
	|	СвязанныеДокументы.ОбъектПечати КАК ОбъектПечати,
	|	СвязанныеДокументы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	СвязанныеДокументы.КоличествоСтраниц КАК КоличествоСтраниц,
	|	СвязанныеДокументы.ДокументКорректировки КАК ДокументКорректировки,
	|	СвязанныеДокументы.СчетФактураВыданный КАК СчетФактураВыданный,
	|	ФиксируемыеПечатныеФормы.ТипДокумента КАК ТипДокумента,
	|	ИдентификаторыМакетов.Ссылка КАК ПечатнаяФорма
	|ПОМЕСТИТЬ НайденныеПечатныеФормы
	|ИЗ
	|	СвязанныеДокументы КАК СвязанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_ФиксируемыеПечатныеФормы.ИдентификаторыМакетовПечатныхФорм КАК ИдентификаторыМакетов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_ФиксируемыеПечатныеФормы КАК ФиксируемыеПечатныеФормы
	|			ПО ИдентификаторыМакетов.Ссылка = ФиксируемыеПечатныеФормы.Ссылка
	|		ПО СвязанныеДокументы.ИдентификаторМакета = ИдентификаторыМакетов.ИдентификаторМакета
	|			И (НЕ ФиксируемыеПечатныеФормы.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_НастройкиФиксацииПечатныхФорм КАК НастройкиФиксацииПечатныхФорм
	|		ПО (ИдентификаторыМакетов.Ссылка = НастройкиФиксацииПечатныхФорм.ПечатнаяФорма)
	|			И (НастройкиФиксацииПечатныхФорм.Используется)
	|			И (НЕ НастройкиФиксацииПечатныхФорм.ПометкаУдаления)
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодИсправленногоСчетаФактуры 
	|			ИЛИ ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодКорректировочногоСчетаФактуры 
	|			ИЛИ ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодСчетаФактуры
	|			ТОГДА ВЫБОР
	|				КОГДА СвязанныеДокументы.СчетФактураВыданный.Исправление
	|					ТОГДА ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодИсправленногоСчетаФактуры
	|				КОГДА СвязанныеДокументы.СчетФактураВыданный.Корректировочный
	|					ТОГДА ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодКорректировочногоСчетаФактуры
	|				ИНАЧЕ ФиксируемыеПечатныеФормы.КодТипаДокумента = &КодСчетаФактуры
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СвязанныеДокументы.ОбъектПечати,
	|	СвязанныеДокументы.ИдентификаторМакета,
	|	СвязанныеДокументы.КоличествоСтраниц,
	|	СвязанныеДокументы.Документ,
	|	СвязанныеДокументы.ДокументКорректировки,
	|	СвязанныеДокументы.СчетФактураВыданный,
	|	ФиксируемыеПечатныеФормы.ТипДокумента,
	|	ИдентификаторыМакетов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеПечатныеФормы.Документ КАК Документ,
	|	НайденныеПечатныеФормы.ДокументКорректировки КАК ДокументКорректировки,
	|	НайденныеПечатныеФормы.СчетФактураВыданный КАК СчетФактураВыданный,
	|	НайденныеПечатныеФормы.ПечатнаяФорма КАК ПечатнаяФорма,
	|	НайденныеПечатныеФормы.ПечатнаяФорма.Наименование КАК ПечатнаяФормаНаименование,
	|	НайденныеПечатныеФормы.ОбъектПечати КАК ОбъектПечати,
	|	ВЫБОР
	|		КОГДА НайденныеПечатныеФормы.ОбъектПечати ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ОбъектПечати КАК Документ.РеализацияТоваровУслуг).Организация
	|		КОГДА НайденныеПечатныеФормы.ОбъектПечати ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ОбъектПечати КАК Документ.КорректировкаРеализации).Организация
	|		КОГДА НайденныеПечатныеФормы.ОбъектПечати ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ОбъектПечати КАК Документ.СчетФактураВыданный).Организация
	|		КОГДА НайденныеПечатныеФормы.ОбъектПечати ССЫЛКА Документ.КорректировкаПриобретения
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ОбъектПечати КАК Документ.КорректировкаПриобретения).Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА НайденныеПечатныеФормы.ТипДокумента = &ИмяТипаДокументаСчетаФактуры
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.СчетФактураВыданный КАК Документ.СчетФактураВыданный).ПредставлениеНомера
	|		КОГДА НайденныеПечатныеФормы.ТипДокумента = &ИмяТипаДокументаРеализации
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.Документ КАК Документ.РеализацияТоваровУслуг).Номер
	|		КОГДА НайденныеПечатныеФормы.ТипДокумента = &ИмяТипаДокументаКорректировкиПриобретения
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ОбъектПечати КАК Документ.КорректировкаПриобретения).Номер
	|		КОГДА НайденныеПечатныеФормы.ТипДокумента = &ИмяТипаДокументаКорректировкиРеализации
	|			ТОГДА ВЫРАЗИТЬ(НайденныеПечатныеФормы.ДокументКорректировки КАК Документ.КорректировкаРеализации).Номер
	|	КОНЕЦ КАК РаспечатанныйНомер,
	|	НайденныеПечатныеФормы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	НайденныеПечатныеФормы.КоличествоСтраниц КАК КоличествоСтраниц,
	|	ВЫБОР
	|		КОГДА 1 В
	|				(ВЫБРАТЬ
	|					1
	|				ИЗ
	|					РегистрСведений.бг_ФиксацияПечатиДокументов.СрезПоследних(, (Документ, ПечатнаяФорма) В
	|						(ВЫБРАТЬ
	|							НайденныеПечатныеФормы.Документ,
	|							НайденныеПечатныеФормы.ПечатнаяФорма
	|						ИЗ
	|							НайденныеПечатныеФормы)) КАК ФиксацияПечатиДокументовСрезПоследних
	|				ГДЕ
	|					ФиксацияПечатиДокументовСрезПоследних.Документ = НайденныеПечатныеФормы.Документ
	|					И ФиксацияПечатиДокументовСрезПоследних.ПечатнаяФорма = НайденныеПечатныеФормы.ПечатнаяФорма)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПервичнаяПечать
	|ИЗ
	|	НайденныеПечатныеФормы КАК НайденныеПечатныеФормы";
	
	Запрос.УстановитьПараметр("РаспечатанныеДокументы", РаспечатанныеДокументы);
	Запрос.УстановитьПараметр("КодИсправленногоСчетаФактуры", "ИСФ");
	Запрос.УстановитьПараметр("КодКорректировочногоСчетаФактуры", "КСФ");
	Запрос.УстановитьПараметр("КодСчетаФактуры", "СФ");
	Запрос.УстановитьПараметр(
		"ИмяТипаДокументаРеализации", 
		Метаданные.Документы.РеализацияТоваровУслуг.Имя);
	Запрос.УстановитьПараметр(
		"ИмяТипаДокументаСчетаФактуры", 
		Метаданные.Документы.СчетФактураВыданный.Имя);
	Запрос.УстановитьПараметр(
		"ИмяТипаДокументаКорректировкиПриобретения", 
		Метаданные.Документы.КорректировкаПриобретения.Имя);
	Запрос.УстановитьПараметр(
		"ИмяТипаДокументаКорректировкиРеализации", 
		Метаданные.Документы.КорректировкаРеализации.Имя);

	Выборка = Запрос.Выполнить().Выбрать();
	
	ПовторноФиксируемыеДокументы = ОтобранныеДокументы.СкопироватьКолонки();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.ПервичнаяПечать Тогда
			
			Если ФиксироватьПовторнуюПечать Тогда
				ЗаполнитьЗначенияСвойств(ПовторноФиксируемыеДокументы.Добавить(), Выборка);	
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;	
		
		ИспользоватьФиксациюПечати = Ложь;
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			ИспользоватьФиксациюПечати = бг_КонстантыПовтИсп.ЗначениеКонстанты(
				"ФиксироватьПечатьДокументов", 
				Выборка.Организация);
		КонецЕсли;
			
		Если ИспользоватьФиксациюПечати Тогда
			ЗаполнитьЗначенияСвойств(ОтобранныеДокументы.Добавить(), Выборка);	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПовторноФиксируемыеДокументы.Количество() <> 0 Тогда
		
		ДанныеПовторноФиксируемыхДокументов = ОбщегоНазначения.ТаблицаЗначенийВМассив(
			ПовторноФиксируемыеДокументы);
			
		АдресПовторноФиксируемыхДокументов = ПоместитьВоВременноеХранилище(ДанныеПовторноФиксируемыхДокументов);
		
	КонецЕсли;
	
	Возврат ОтобранныеДокументы;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьВременнуюТаблицуСвязанныхДокументов(МенеджерВременныхТаблиц, РаспечатанныеДокументы)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспечатанныеДокументы.ОбъектПечати КАК ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц КАК КоличествоСтраниц
	|ПОМЕСТИТЬ РаспечатанныеДокументы
	|ИЗ
	|	&РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РаспечатанныеДокументы.ОбъектПечати КАК ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета КАК ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц КАК КоличествоСтраниц,
	|	NULL КАК ДокументКорректировки,
	|	СчетаФактурыВыданные.Ссылка КАК СчетФактураВыданный
	|ПОМЕСТИТЬ СвязанныеДокументы
	|ИЗ
	|	РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.РеализацияТоваровУслуг)) = РеализацияТоваровУслуг.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(СчетФактураВыданныйДокументыОснования.Ссылка) КАК Ссылка,
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг) КАК Реализация
	|		ИЗ
	|			Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ГДЕ
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг) В
	|					(ВЫБРАТЬ
	|						РаспечатанныеДокументы.ОбъектПечати
	|					ИЗ
	|						РаспечатанныеДокументы
	|					ГДЕ
	|						РаспечатанныеДокументы.ОбъектПечати ССЫЛКА Документ.РеализацияТоваровУслуг)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) КАК СчетаФактурыВыданные
	|		ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.РеализацияТоваровУслуг)) = СчетаФактурыВыданные.Реализация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокКорректировкаРеализации.ДокументОснование,
	|	РаспечатанныеДокументы.ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц,
	|	ДокКорректировкаРеализации.Ссылка,
	|	СчетаФактурыВыданные.Ссылка
	|ИЗ
	|	РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДокКорректировкаРеализации
	|		ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.КорректировкаРеализации)) = ДокКорректировкаРеализации.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(СчетФактураВыданныйДокументыОснования.Ссылка) КАК Ссылка,
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации) КАК КорректировкаРеализации
	|		ИЗ
	|			Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ГДЕ
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации) В
	|					(ВЫБРАТЬ
	|						РаспечатанныеДокументы.ОбъектПечати
	|					ИЗ
	|						РаспечатанныеДокументы
	|					ГДЕ
	|						РаспечатанныеДокументы.ОбъектПечати ССЫЛКА Документ.КорректировкаРеализации)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации)) КАК СчетаФактурыВыданные
	|		ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.КорректировкаРеализации)) = СчетаФактурыВыданные.КорректировкаРеализации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетаФактурыВыданные.ДокументРеализации ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(СчетаФактурыВыданные.КорректировкаРеализации.ДокументОснование КАК Документ.РеализацияТоваровУслуг)
	|		КОГДА СчетаФактурыВыданные.КорректировкаРеализации ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(СчетаФактурыВыданные.ДокументРеализации КАК Документ.РеализацияТоваровУслуг)
	|	КОНЕЦ,
	|	РаспечатанныеДокументы.ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц,
	|	СчетаФактурыВыданные.КорректировкаРеализации,
	|	СчетаФактурыВыданные.Ссылка
	|ИЗ
	|	РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)) КАК ДокументРеализации,
	|			NULL КАК КорректировкаРеализации
	|		ИЗ
	|			РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|				ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.СчетФактураВыданный)) = СчетФактураВыданныйДокументыОснования.Ссылка)
	|		ГДЕ
	|			СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СчетФактураВыданныйДокументыОснования.Ссылка
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СчетФактураВыданныйДокументыОснования.Ссылка,
	|			NULL,
	|			МАКСИМУМ(ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.КорректировкаРеализации))
	|		ИЗ
	|			РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|				ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.СчетФактураВыданный)) = СчетФактураВыданныйДокументыОснования.Ссылка)
	|		ГДЕ
	|			СчетФактураВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СчетФактураВыданныйДокументыОснования.Ссылка) КАК СчетаФактурыВыданные
	|		ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.СчетФактураВыданный)) = СчетаФактурыВыданные.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязанныйДокументРеализации.Документ,
	|	РаспечатанныеДокументы.ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц,
	|	NULL,
	|	МАКСИМУМ(СчетФактураВыданныйДокументыОснования.Ссылка)
	|ИЗ
	|	РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка) КАК Документ,
	|			РаспечатанныеДокументы.ОбъектПечати КАК ОбъектПечати,
	|			РаспечатанныеДокументы.ИдентификаторМакета КАК ИдентификаторМакета
	|		ИЗ
	|			РаспечатанныеДокументы КАК РаспечатанныеДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|						ПО ((ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.бг_ДокументОснованиеПоступлениеОтПоставщика КАК Документ.ПриобретениеТоваровУслуг)) = ПриобретениеТоваровУслуг.Ссылка)
	|					ПО ((ВЫРАЗИТЬ(КорректировкаПриобретения.ДокументОснование КАК Документ.ПриобретениеТоваровУслуг)) = ПриобретениеТоваровУслуг.Ссылка)
	|				ПО ((ВЫРАЗИТЬ(РаспечатанныеДокументы.ОбъектПечати КАК Документ.КорректировкаПриобретения)) = КорректировкаПриобретения.Ссылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РаспечатанныеДокументы.ОбъектПечати,
	|			РаспечатанныеДокументы.ИдентификаторМакета) КАК СвязанныйДокументРеализации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО (СвязанныйДокументРеализации.Документ = (ВЫРАЗИТЬ(СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Документ.РеализацияТоваровУслуг)))
	|		ПО РаспечатанныеДокументы.ОбъектПечати = СвязанныйДокументРеализации.ОбъектПечати
	|			И РаспечатанныеДокументы.ИдентификаторМакета = СвязанныйДокументРеализации.ИдентификаторМакета
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспечатанныеДокументы.ОбъектПечати,
	|	РаспечатанныеДокументы.ИдентификаторМакета,
	|	РаспечатанныеДокументы.КоличествоСтраниц,
	|	СвязанныйДокументРеализации.Документ";
	
	Запрос.УстановитьПараметр("РаспечатанныеДокументы", РаспечатанныеДокументы);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ИнициализироватьТаблицуОтобранныхПоНастройкамДокументов(РаспечатанныеДокументы)
	
	ОтобранныеДокументы = РаспечатанныеДокументы.СкопироватьКолонки();
	ОтобранныеДокументы.Колонки.Добавить(
		"ПечатнаяФорма", 
		Новый ОписаниеТипов("СправочникСсылка.бг_ФиксируемыеПечатныеФормы"));
		
	ОтобранныеДокументы.Колонки.Добавить(
		"ПечатнаяФормаНаименование", 
		ОбщегоНазначения.ОписаниеТипаСтрока(100));
		
	ОтобранныеДокументы.Колонки.Добавить(
		"Документ", 
		Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
		
	ОтобранныеДокументы.Колонки.Добавить(
		"ДокументКорректировки", 
		Новый ОписаниеТипов("ДокументСсылка.КорректировкаРеализации"));
		
	ОтобранныеДокументы.Колонки.Добавить(
		"СчетФактураВыданный", 
		Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный"));
		
	ОтобранныеДокументы.Колонки.Добавить(
		"РаспечатанныйНомер", 
		ОбщегоНазначения.ОписаниеТипаСтрока(12)); 
		
	Возврат ОтобранныеДокументы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
